ansible/playbooks/results/pgbench_longhorn/pgbench_result_cnpg.txt
pgbench (18.3 (Ubuntu 18.3-1.pgdg24.04+1), server 18.1 (Debian 18.1-1.pgdg13+2))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 3000
query mode: simple
number of clients: 295
number of threads: 8
maximum number of tries: 1
duration: 900 s
number of transactions actually processed: 2248168
number of failed transactions: 0 (0.000%)
latency average = 118.103 ms
initial connection time = 797.823 ms
tps = 2497.811928 (without initial connection time)